# -*- orgstrap-cypher: sha256; orgstrap-norm-func-name: orgstrap-norm-func--dprp-1-0; orgstrap-block-checksum: 538cbeca97475e9cdd254b73e46727eab7b604c9cca4435d7741def3b8ec1004; -*-
# [[orgstrap][jump to the orgstrap block for this file]]

#+header: :exports code
#+name: orgstrap-shebang
#+begin_src bash :eval never :results none :exports none
set -e "-C" "-e" "-e"
{ null=/dev/null;} > "${null:=/dev/null}"
{ args=;file=;MyInvocation=;__p=$(mktemp -d);touch ${__p}/=;chmod +x ${__p}/=;__op=$PATH;PATH=${__p}:$PATH;} > "${null}"
$file = $MyInvocation.MyCommand.Source
{ file=$0;PATH=$__op;rm ${__p}/=;rmdir ${__p};} > "${null}"
emacs -batch -no-site-file -eval "(let (vc-follow-symlinks) (defun orgstrap--confirm-eval (l _) (not (memq (intern l) '(elisp emacs-lisp)))) (let ((file (pop argv)) enable-local-variables) (find-file-literally file) (end-of-line) (when (eq (char-before) ?\^m) (let ((coding-system-for-read 'utf-8)) (revert-buffer nil t t)))) (let ((enable-local-eval t) (enable-local-variables :all) (major-mode 'org-mode)) (require 'org) (org-set-regexps-and-options) (hack-local-variables)))" "${file}" -- ${args} "${@}"
exit
<# powershell open
#+end_src

** Day 1: Sonar Sweep
Count the number of times a depth measurement increases from the previous measurement.
*NB:* /When looping the first item, there is no previous measurement./

#+begin_html
<details><summary>Result <code>0101</code></summary>
  <p>
#+end_html

[[file:src/challenge/0101.go][Source]]

#+name: 0101
#+begin_src bash :format raw :exports both :dir src
cat ../dataset/01.txt | go run aoc 0101
#+end_src

#+RESULTS:
: 1400

#+begin_html
</p></details>
#+end_html

*Part two*
Count the number of times the sum of measurements in this sliding window increases from the previous sum.

#+begin_html
<details><summary>Result <code>0102</code></summary>
  <p>
#+end_html

[[file:src/challenge/0102.go][Source]]

#+name: 0102
#+begin_src bash :format raw :exports both :dir src
cat ../dataset/01.txt | go run aoc 0102
#+end_src

#+RESULTS:
: 1429

#+begin_html
</p></details>
#+end_html

** Day 2: Dive!
Calculate the horizontal position and depth you would have after following the planned course. What do you get if you multiply your final horizontal position by your final depth?

#+begin_html
<details><summary>Result <code>0201</code></summary>
  <p>
#+end_html

[[file:src/challenge/0201.go][Source]]

#+name: 0201
#+begin_src bash :format raw :exports both :dir src
cat ../dataset/02.txt | go run aoc 0201
#+end_src

#+RESULTS:
: 1580000

#+begin_html
</p></details>
#+end_html

*Part two*
Using this new interpretation of the commands, calculate the horizontal position and depth you would have after following the planned course. What do you get if you multiply your final horizontal position by your final depth?

#+begin_html
<details><summary>Result <code>0202</code></summary>
  <p>
#+end_html

[[file:src/challenge/0202.go][Source]]

#+name: 0202
#+begin_src bash :format raw :exports both :dir src
cat ../dataset/02.txt | go run aoc 0202
#+end_src

#+RESULTS:
: 1251263225

#+begin_html
</p></details>
#+end_html

